ir_version: 7
producer_name: 'onnx'
graph {
  node {
    input: 'input_tensor'
    output: 'conv1_out'
    op_type: 'Conv'
    attribute {
      name: 'kernel_shape'
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: 'strides'
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: 'pads'
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: 'conv1_out'
    output: 'pool1_out'
    op_type: 'MaxPool'
    attribute {
      name: 'kernel_shape'
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: 'strides'
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: 'pool1_out'
    output: 'conv2_out'
    op_type: 'Conv'
    attribute {
      name: 'kernel_shape'
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: 'strides'
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: 'pads'
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: 'conv2_out'
    output: 'pool2_out'
    op_type: 'MaxPool'
    attribute {
      name: 'kernel_shape'
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: 'strides'
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: 'pool2_out'
    output: 'fc_out'
    op_type: 'Flatten'
  }
  node {
    input: 'fc_out'
    output: 'output_tensor'
    op_type: 'Gemm'
    attribute {
      name: 'alpha'
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: 'beta'
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: 'transB'
      i: 1
      type: INT
    }
  }
  name: 'VideoClassificationModel'
  input {
    name: 'input_tensor'
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: 'batch_size'
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 224
          }
          dim {
            dim_value: 224
          }
        }
      }
    }
  }
  output {
    name: 'output_tensor'
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: 'batch_size'
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
}